---
kind: method
id: M:Autodesk.Revit.DB.CategoryNameMapIterator.#ctor
source: html/b32964f7-88f3-204d-798c-a1fcce52d01e.htm
---
# Autodesk.Revit.DB.CategoryNameMapIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public CategoryNameMapIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.